**Exercise 1**.

- Create the `mtcars` DataFrame from this URL `https://bit.ly/3oAZyrd`
- Find the mean `wt` by number of cylinders sorted in decreasing order, keeping the result as a DataFrame.
- Find all car models that have numbers in the name
- Create a correlation matrix of `hp`, `weight` and `qsec` for cars with 4 gears

In [2]:
import pandas as pd
url = 'https://bit.ly/3oAZyrd'

In [25]:
# Create data frame from url
df = pd.read_csv(url)
df.head()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [24]:
# Find the mean wt by number of cylinders, sorted in decreasing order
df.groupby('cyl').mean().filter(items = ['wt']).sort_index(axis = 0, ascending = False)

# Answer key
mtcars.groupby('cyl')[['wt']].mean().sort_values('wt', ascending=False)

           wt
cyl
8    3.999214
6    3.117143
4    2.285727

In [25]:
# Find all car models that have numbers in the name
df[df.model.str.contains('[0-9]')].filter(items = ['model'])

# Answer key
mtcars.model[mtcars.model.str.contains(r'\d+')]

             model
0        Mazda RX4
1    Mazda RX4 Wag
2       Datsun 710
3   Hornet 4 Drive
6       Duster 360
7        Merc 240D
8         Merc 230
9         Merc 280
10       Merc 280C
11      Merc 450SE
12      Merc 450SL
13     Merc 450SLC
17        Fiat 128
23      Camaro Z28
25       Fiat X1-9
26   Porsche 914-2
31      Volvo 142E

In [26]:
# Create a correlation matrix of hp, weight, and qsec for cars with 4 years
df[df.gear == 4].filter(items = ['hp', 'wt', 'qsec']).corr()

# Answer key
mtcars[mtcars.gear==4][['hp', 'wt', 'qsec']].corr()

            hp        wt      qsec
hp    1.000000  0.734547 -0.320707
wt    0.734547  1.000000  0.104589
qsec -0.320707  0.104589  1.000000

**Exercise 2**.

- Convert the data in `mess.txt` to the DataFrame in `tidy.csv` using Pandas operations

In [28]:
# Display mess.txt
! cat data/mess.txt

desc gene1 gene2 gene3
a-23-duke 11.2 12.3 13.4
b-34-unc 10.7 13.4 9.8
c-44-duke 9.0 9.9 14.2
d-42-unc 11.6 10.7 8.9

In [33]:
# Load and display tidy.csv
tidy = pd.read_csv('data/tidy.csv')
tidy

   name  age  site  gene expression
0     a   23  duke  desc  a-23-duke
1     a   23  duke     1       11.2
2     a   23  duke     2       12.3
3     a   23  duke     3       13.4
4     b   34   unc  desc   b-34-unc
5     b   34   unc     1       10.7
6     b   34   unc     2       13.4
7     b   34   unc     3        9.8
8     c   44  duke  desc  c-44-duke
9     c   44  duke     1        9.0
10    c   44  duke     2        9.9
11    c   44  duke     3       14.2
12    d   42   unc  desc   d-42-unc
13    d   42   unc     1       11.6
14    d   42   unc     2       10.7
15    d   42   unc     3        8.9

In [64]:
# Load mess as Pandas df
mess = pd.read_table('data/mess.txt')
mess

     desc gene1 gene2 gene3
0  a-23-duke 11.2 12.3 13.4
1    b-34-unc 10.7 13.4 9.8
2    c-44-duke 9.0 9.9 14.2
3    d-42-unc 11.6 10.7 8.9

In [54]:
# Create 4 separate columns, and make copy of desc column
mess2 = mess['desc gene1 gene2 gene3'].str.split(' ').apply(pd.Series, index = ['desc', 'gene1', 'gene2', 'gene3'])
mess2['tosplit'] = mess2['desc']
mess2 = mess2[['tosplit', 'desc', 'gene1', 'gene2', 'gene3']]
mess2

     tosplit       desc gene1 gene2 gene3
0  a-23-duke  a-23-duke  11.2  12.3  13.4
1   b-34-unc   b-34-unc  10.7  13.4   9.8
2  c-44-duke  c-44-duke   9.0   9.9  14.2
3   d-42-unc   d-42-unc  11.6  10.7   8.9

In [55]:
# Split first column into name, age, and site
mess2[['name', 'age', 'site']] = mess2['tosplit'].str.split('-').apply(pd.Series, index = ['name', 'age', 'site'])
mess3 = mess2[['name', 'age', 'site', 'desc', 'gene1', 'gene2', 'gene3']]
mess3

  name age  site       desc gene1 gene2 gene3
0    a  23  duke  a-23-duke  11.2  12.3  13.4
1    b  34   unc   b-34-unc  10.7  13.4   9.8
2    c  44  duke  c-44-duke   9.0   9.9  14.2
3    d  42   unc   d-42-unc  11.6  10.7   8.9

In [63]:
pd.melt(mess3, id_vars = ['name', 'age', 'site'], value_vars = ['desc', 'gene1', 'gene2', 'gene3'], var_name = 'gene', 
        value_name = "expression").sort_values(by = ['name'], ascending = True).reset_index(drop = True)

   name age  site   gene expression
0     a  23  duke   desc  a-23-duke
1     a  23  duke  gene1       11.2
2     a  23  duke  gene2       12.3
3     a  23  duke  gene3       13.4
4     b  34   unc   desc   b-34-unc
5     b  34   unc  gene1       10.7
6     b  34   unc  gene2       13.4
7     b  34   unc  gene3        9.8
8     c  44  duke   desc  c-44-duke
9     c  44  duke  gene1        9.0
10    c  44  duke  gene2        9.9
11    c  44  duke  gene3       14.2
12    d  42   unc   desc   d-42-unc
13    d  42   unc  gene1       11.6
14    d  42   unc  gene2       10.7
15    d  42   unc  gene3        8.9

In [31]:
# (Adapted) answer key
df = pd.read_csv('data/mess.txt', sep=' ')
df[['name', 'age', 'site']] = df.desc.str.split('-', expand=True)
df = pd.melt(df, id_vars=['name', 'age', 'site'], var_name='gene', value_name='expression')
df['gene'] = df.gene.str.replace('gene', '')
df.sort_values('name').reset_index(drop = True)

   name age  site  gene expression
0     a  23  duke  desc  a-23-duke
1     a  23  duke     1       11.2
2     a  23  duke     2       12.3
3     a  23  duke     3       13.4
4     b  34   unc  desc   b-34-unc
5     b  34   unc     1       10.7
6     b  34   unc     2       13.4
7     b  34   unc     3        9.8
8     c  44  duke  desc  c-44-duke
9     c  44  duke     1          9
10    c  44  duke     2        9.9
11    c  44  duke     3       14.2
12    d  42   unc  desc   d-42-unc
13    d  42   unc     1       11.6
14    d  42   unc     2       10.7
15    d  42   unc     3        8.9

**Exercise 3**.

- Repeat exercise 2 as a single chained command. (Challenging)

In [24]:
# Got started but fell short
pd.read_table('data/mess.txt')['desc gene1 gene2 gene3'].str.split(' ').apply(
    pd.Series, index = ['desc', 'gene1', 'gene2', 'gene3'])

        desc gene1 gene2 gene3
0  a-23-duke  11.2  12.3  13.4
1   b-34-unc  10.7  13.4   9.8
2  c-44-duke   9.0   9.9  14.2
3   d-42-unc  11.6  10.7   8.9

In [34]:
# This is the Python version of piping in tidyverse. Assign is like mutate

(
    pd.read_csv('data/mess.txt', sep=' ').
    assign(
        name = lambda x: x.desc.str.split('-').str[0],
        age = lambda x: x.desc.str.split('-').str[1],
        site = lambda x: x.desc.str.split('-').str[2]
    ).
    melt(id_vars=['name', 'age', 'site'], var_name='gene', value_name='expression').
    assign(gene=lambda x: x.gene.str.replace('gene', '')).
    sort_values('name').
    reset_index(drop = True)
)

   name age  site  gene expression
0     a  23  duke  desc  a-23-duke
1     a  23  duke     1       11.2
2     a  23  duke     2       12.3
3     a  23  duke     3       13.4
4     b  34   unc  desc   b-34-unc
5     b  34   unc     1       10.7
6     b  34   unc     2       13.4
7     b  34   unc     3        9.8
8     c  44  duke  desc  c-44-duke
9     c  44  duke     1          9
10    c  44  duke     2        9.9
11    c  44  duke     3       14.2
12    d  42   unc  desc   d-42-unc
13    d  42   unc     1       11.6
14    d  42   unc     2       10.7
15    d  42   unc     3        8.9